{
  "Hey there, learner! I'm Vyas, your personal AI tutor. I'm so excited to explore the world of shapes and sizes with you. Ready to start our first adventure?": "tutor_360451489b30.mp3",
  "Awesome! Now I'm going to move over here to the left side so we can see our learning space better! ✨": "tutor_d9d237c3db05.mp3",
  "Perfect! Let's start with a simple question. Imagine this is your room. How would you figure out how long it is from one wall to the other?": "tutor_5337e8a1fa35.mp3",
  "A common way is to use footsteps! Let's try it. Help me walk from one side to the other by clicking the button for each step.": "tutor_0a423f3c7f1f.mp3",
  "Okay, so the room is 10 steps long. Simple enough! But wait... here comes your friend, who has bigger feet. He doesn't believe that the room is 10 steps long. He will use his own steps to measure the room. Help him measure the room too - click the button for each of his steps.": "tutor_8512495b9a6e.mp3",
  "Hold on. One person says the room is 10 steps long, and another says it's 8 steps long. But the room didn't change! Who is right? This is confusing, isn't it?": "tutor_7506044c876b.mp3",
  "What do you think is the reason?": "tutor_b919da8f81ba.mp3",
  "No, the size of the room is the same. Choose again.": "tutor_fa592ef418cf.mp3",
  "Exactly, the size of your feet and your friend's feet are different. Because of this, we cannot use our feet to measure the room, because everyone will get a different number.": "tutor_8359a747f6e1.mp3",
  "What if we had a tool that was the same for everyone in this room? And the same for kids in the classroom next door? And the same for kids all over the world? To solve this problem, people all over the world agreed to use **standard units**.": "tutor_640540e5a26d.mp3",
  "A standard unit is something which measures the same for everyone. One of the standard units is the **centimeter (cm)**. It's very small, perfect for measuring little things.": "tutor_9c05df32c20b.mp3",
  "Nice! For bigger things, we use a bigger unit called a meter. A meter is the same as 100 centimeters. See how this meter stick compares to the height of a door?": "tutor_f2153a806bc2.mp3",
  "Time for a quick check! If you wanted to measure a crayon, which unit would you use? Click on the best choice.": "tutor_1cf708f90ba7.mp3",
  "Exactly! Centimeters are perfect for that.": "tutor_4bfe0c2848af.mp3",
  "Good try, but a meter is way too big for a crayon! Centimeters are the better choice here.": "tutor_00f26cf26bbe.mp3",
  "Great job! Now for a real challenge. You'll see a shape with colored sides. Your mission is to figure out the length of each colored side using a special on-screen ruler that you can drag around. Once you measure a side, enter its length in the input box. Let's see what you've got!": "tutor_b5f5b601f773.mp3",
  "Here's our first object: a notebook. Use the ruler to measure the length of the highlighted blue edge. Then, type your answer in the box and click 'Check'.": "tutor_e7f2ccf7df7c.mp3",
  "Next, measure this sticky note. It's a perfect square. Measure the highlighted side.": "tutor_68f3677fee1f.mp3",
  "Try this coaster, also square but a bit larger. Measure the highlighted bottom edge.": "tutor_352ff49ba845.mp3",
  "Finally, measure the base of this little house sign (a pentagon).": "tutor_45de8babc912.mp3",
  "And that's a wrap! You did a fantastic job measuring those shapes. Using tools like rulers is a very important skill in math and science. You should be proud!": "tutor_c980c1edcd45.mp3",
  "Correct! Great job measuring.": "tutor_d6c50e0a217f.mp3",
  "Not quite. Try adjusting the ruler and measuring again.": "tutor_1576466e0d97.mp3"
}