{
  "Hey there!": "tutor_12f7adab78f9.mp3",
  "Let's start with a simple question. Imagine this is your room. How would you figure out how long it is from one wall to the other?": "tutor_a0e87697794f.mp3",
  "A common way is to use footsteps! Let's try it. Help me walk from one side to the other by clicking the button for each step.": "tutor_0a423f3c7f1f.mp3",
  "Okay, so the room is 10 steps long.   Simple enough! But wait... here comes your friend, who has bigger feet. He doesn't believe that the room is 10 steps long. He will use his own steps to measure the room.   Help him measure the room too - click the button for each of his steps.": "tutor_018f157a2049.mp3",
  "Hold on. One person says the room is 10 steps long, and another says it's 8 steps long.   But the room didn't change! Who is right? This is confusing, isn't it?": "tutor_3452f4e0aa96.mp3",
  "What do you think is the reason?": "tutor_b919da8f81ba.mp3",
  "What if we had a tool that was the same for everyone in this room?   And the same for kids in the classroom next door?   And the same for kids all over the world?   To solve this problem, people all over the world agreed to use standard units.": "tutor_87b6a14d00ab.mp3",
  "A standard unit is something which measures the same for everyone.   One of the standard units is the centimeter (cm). It's very small, perfect for measuring little things.": "tutor_4a97f1f69148.mp3",
  "Nice! For bigger things, we use a bigger unit called a meter.   A meter is the same as 100 centimeters.   See how this meter stick compares to the height of a door?": "tutor_4aded00a0c2a.mp3",
  "Time for a quick check! If you wanted to measure a crayon, which unit would you use? Click on the best choice.": "tutor_1cf708f90ba7.mp3",
  "Great job! Now for a real challenge. You'll see a shape with colored sides. Your mission is to figure out the length of each colored side using a special on-screen ruler that you can drag around.   Once you measure a side, enter its length in the input box. Let's see what you've got!": "tutor_28bb391eb0e6.mp3",
  "Here's our first object: a notebook.   Use the ruler to measure the length of the highlighted blue edge.   Then, type your answer in the box and click 'Check'.": "tutor_cbb48ff242bf.mp3",
  "Next, measure this sticky note. It's a perfect square. Measure the highlighted side.": "tutor_68f3677fee1f.mp3",
  "Try this coaster, also square but a bit larger. Measure the highlighted bottom edge.": "tutor_352ff49ba845.mp3",
  "Finally, measure the base of this little house sign (a pentagon).": "tutor_45de8babc912.mp3",
  "And that's a wrap! You did a fantastic job measuring those shapes.   Using tools like rulers is a very important skill in math and science. You should be proud!": "tutor_3cfb3317d986.mp3",
  "No, the size of the room is the same. Choose again.": "tutor_fa592ef418cf.mp3",
  "Exactly, the size of your feet and your friend's feet are different.   Because of this, we cannot use our feet to measure the room, because everyone will get a different number.": "tutor_4ebe8936d9b6.mp3",
  "Fantastic! You're now set with your knowledge of units and shapes.   With these tools, we're ready to help someone solve a real problem. Are you up for a mission?": "tutor_9c4f0957a4ac.mp3",
  "Excellent! Let me introduce you to Farmer Giles.   He's in a bit of a pickle and needs our help.": "tutor_3d1029aa9508.mp3",
  "Farmer Giles loves his sheep, but a sneaky fox has been spotted nearby!   He needs to build a fence around his entire farm to keep his flock safe.": "tutor_c5a20c76dc62.mp3",
  "Fantastic! Here's the plan.   This is a map of his farm. It's a perfect rectangle.   We need to figure out the total length of the boundary to know how much fencing material to buy.": "tutor_dcc91195054e.mp3",
  "This total length around the outside edge of a shape has a very important name in mathematics.   It's called the Perimeter.": "tutor_5d7b916c6b69.mp3",
  "To find the perimeter, we need to add up the lengths of all the sides.   Let's give it a try with Farmer Giles' field. What's the total length of the fence he needs?": "tutor_e96724714e0a.mp3",
  "Great job! Farmer Giles needs 100 meters of fencing.": "tutor_f30eeb62c10a.mp3",
  "Now that you've got the hang of it, let's help some other people with their fencing problems.   What's the perimeter of this next field?": "tutor_7757ffb139df.mp3",
  "You're a real pro at this!   Ready for a new challenge?": "tutor_2b2536c92bba.mp3",
  "Great job! Just one more to go!": "tutor_772c70a593be.mp3",
  "You did it! You've successfully helped Farmer Giles and so many others. You're a perimeter pro!": "tutor_c9bf0d7e6836.mp3",
  "Exactly! Centimeters are perfect for that.": "tutor_4bfe0c2848af.mp3",
  "Good try, but a meter is way too big for a crayon! Centimeters are the better choice here.": "tutor_00f26cf26bbe.mp3",
  "Correct! Great job measuring.": "tutor_d6c50e0a217f.mp3",
  "Not quite. Try adjusting the ruler and measuring again.": "tutor_1576466e0d97.mp3",
  "That's exactly right! The perimeter is 100 meters.": "tutor_e12d0a1a94b8.mp3",
  "Not quite. Remember, the perimeter is the total length around the entire outside edge of the farm.   Take another look and try again.": "tutor_4924a3f5c71b.mp3",
  "Hmm, let's try a different approach. Let's add up the sides together.   Thirty plus twenty plus thirty plus twenty equals one hundred.": "tutor_382fbc405e06.mp3",
  "Exactly! The perimeter of this square field is 60 meters.": "tutor_3a991a560992.mp3",
  "Not quite, try again!": "tutor_2a900451f69f.mp3",
  "Let's work this one out together.   Since all four sides of a square are equal, we can add them up like this: Fifteen plus fifteen plus fifteen plus fifteen equals sixty.": "tutor_b005cebec479.mp3",
  "Perfect! The perimeter is 40 meters.": "tutor_99b86f018e13.mp3",
  "That's not it. Give it another shot!": "tutor_24722b400820.mp3",
  "No problem. Let's add them up:   Ten plus twelve plus eighteen equals forty.": "tutor_d61a8f6043a7.mp3",
  "Incredible! The perimeter of this pentagon is 40 meters.": "tutor_b778788810f1.mp3",
  "Not quite right. Remember, a pentagon has five sides!": "tutor_f154183908bc.mp3",
  "Let's add them up together:   Eight plus eight plus eight plus eight plus eight equals forty.": "tutor_ada5e5b288ae.mp3"
}