{
  "Hey there, learner! I'm Vyas, your personal AI tutor. I'm so excited to explore the world of shapes and sizes with you. Ready to start our first adventure?": "tutor_360451489b30.mp3",
  "Awesome! Now I'm going to move over here to the left side so we can see our learning space better! ✨": "tutor_d9d237c3db05.mp3",
  "Perfect! Let's start with a simple question. Imagine this is your room. How would you figure out how long it is from one wall to the other?": "tutor_5337e8a1fa35.mp3",
  "A common way is to use footsteps! Let's try it. Help me walk from one side to the other by clicking the button for each step.": "tutor_0a423f3c7f1f.mp3",
  "Okay, so the room is 10 steps long. Simple enough! But wait... here comes my friend, who has much bigger feet. Help him measure the room too - click the button for each of his steps.": "tutor_96e6b432bdaa.mp3",
  "Hold on. One person says the room is 10 steps long, and another says it's 8 steps long. But the room didn't change! Who is right? This is confusing, isn't it?": "tutor_7506044c876b.mp3",
  "This is why we need 'Standard Units'! They are fixed measurements that everyone agrees on, so we all get the same answer.": "tutor_2c8af57ff68d.mp3",
  "Let's start with a small unit called a centimeter. We often use a ruler to measure it. See this paperclip? It's exactly 3 centimeters long.": "tutor_e1afa7fd548b.mp3",
  "Nice! For bigger things, we use a bigger unit called a meter. A meter is the same as 100 centimeters. See how this meter stick compares to the height of a door?": "tutor_f2153a806bc2.mp3",
  "Time for a quick check! If you wanted to measure a crayon, which unit would you use? Click on the best choice.": "tutor_1cf708f90ba7.mp3",
  "Exactly! Centimeters are perfect for that.": "tutor_4bfe0c2848af.mp3",
  "Good try, but a meter is way too big for a crayon! Centimeters are the better choice here.": "tutor_00f26cf26bbe.mp3",
  "Great job! Now for a real challenge. You'll see a shape with colored sides. Your mission is to figure out the length of each colored side using a special on-screen ruler that you can drag around. Once you measure a side, enter its length in the input box. Let's see what you've got!": "tutor_b5f5b601f773.mp3",
  "Here's our first object: a notebook. Use the ruler to measure the length of the highlighted blue edge. Then, type your answer in the box and click 'Check'.": "tutor_e7f2ccf7df7c.mp3",
  "Correct! Great job measuring.": "tutor_d6c50e0a217f.mp3",
  "Not quite. Try adjusting the ruler and measuring again.": "tutor_1576466e0d97.mp3"
}